rkz/extension/Documents/ПроизводственнаяОперация2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПроизводственнаяОперация2_2</Name>
		</Properties>
	</Document>
</MetaDataObject>

rkz/extension/InformationRegisters/бит_СоставИсполнителейИВремяВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>бит_СоставИсполнителейИВремяВыполнения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧасыНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧасыФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СменноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПроизводства</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

rkz/extension/Enums/ЕдиницыИзмеренияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЕдиницыИзмеренияВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сутки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Секунда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

rkz/extension/Documents/ПроизводственнаяОперация2_2/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [20.08.2024] +        
	
	Если НЕ РольДоступна("бит_ПравоРедактированияКомментария") Тогда
		
		Если ЗначениеЗаполнено(Объект.Этап) 
			И ЗначениеЗаполнено(Объект.Этап.Распоряжение) 
			И ЗначениеЗаполнено(Объект.Этап.Распоряжение.ДокументОснование)Тогда
			
			Если Объект.Этап.Распоряжение.ДокументОснование.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда	
				
				Элементы.Комментарий.ТолькоПросмотр = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ9] [ASHolyavko@1cbit.ru] [20.08.2024] -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ12] [ASHolyavko@1cbit.ru] [20.08.2024] +        
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Толеранс", Тип("ПолеФормы"), Элементы.ГруппаОсновноеПраво);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Толеранс";
	НовыйЭлемент.Заголовок = "(бит) Толеранс";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ12] [ASHolyavko@1cbit.ru] [20.08.2024] -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:02:31] +        
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_АтрибутыТары");
	НоваяКоманда.Заголовок = "Атрибуты тары";
	НоваяКоманда.Действие = "бит_АтрибутыТары";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_АтрибутыТары", Тип("КнопкаФормы"), Элементы.ВыходныеИзделия.КоманднаяПанель);
	НовыйЭлемент.Заголовок = "Атрибуты тары";
	НовыйЭлемент.ИмяКоманды = "бит_АтрибутыТары";
	// }}ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:02:31] -
	
	
	// {{ПервыйБИТ ЛистТребований [6.1.1] [ASHolyavko@1cbit.ru] [09.11.2025] +        
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ВремяВыполненияНорма", Тип("ПолеФормы"), Элементы.ГруппаВремяВыполнения, Элементы.ВремяВыполнения);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ВремяВыполненияНорма";
	НовыйЭлемент.Доступность = Ложь;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ВремяВыполненияНормаНадписьЧас", Тип("ДекорацияФормы"), Элементы.ГруппаВремяВыполнения, Элементы.ВремяВыполнения);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = "ч.";
		
	//НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ПроцентВыполненияВремени", Тип("ПолеФормы"), Элементы.ГруппаВремяВыполнения);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "Объект.бит_ПроцентВыполненияВремени";
	//НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_ПроцентВыполненияВремениПриИзменении");
	//Если ЗначениеЗаполнено(Объект.СменноеЗадание) 
	//	И Объект.СменноеЗадание.Статус = Перечисления.СтатусыСменныхЗаданий.Закрыто Тогда
	//	НовыйЭлемент.Доступность = Ложь;
	//КонецЕсли;
	//
	//Если Объект.бит_ВремяВыполненияНорма <> 0 
	//	И Окр(100 * Объект.ВремяВыполнения / Объект.бит_ВремяВыполненияНорма, 2) <> Объект.бит_ПроцентВыполненияВремени Тогда
	//	НовыйЭлемент.ЦветТекста = Новый Цвет(255,0,0);
	//	НовыйЭлемент.Шрифт = Новый Шрифт(,,Истина);
	//КонецЕсли;
	
	НоваяГруппа = Этаформа.Элементы.Вставить("бит_ГруппаКоличествоПланФакт", Тип("ГруппаФормы"), Элементы.СтраницаВыходныеИзделия);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Заголовок = "";
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_КоличествоПлан", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КоличествоПлан";
	Если ЗначениеЗаполнено(Объект.СменноеЗадание) 
		И Объект.СменноеЗадание.Статус = Перечисления.СтатусыСменныхЗаданий.Закрыто Тогда
		НовыйЭлемент.Доступность = Ложь;
	КонецЕсли;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_КоличествоФакт", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КоличествоФакт";
	Если ЗначениеЗаполнено(Объект.СменноеЗадание) 
		И Объект.СменноеЗадание.Статус = Перечисления.СтатусыСменныхЗаданий.Закрыто Тогда
		НовыйЭлемент.Доступность = Ложь;
	КонецЕсли;

	Если ЭтаФорма.Элементы.Найти("бит_СтраницаСоставБригады") = Неопределено Тогда
		НоваяСтраница = Этаформа.Элементы.Вставить("бит_СтраницаСоставБригады", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ГруппаСтраницы, Неопределено);
		НоваяСтраница.Вид = ВидГруппыФормы.Страница;
		НоваяСтраница.Заголовок = "(бит) Должности и типы начислений";
		НоваяСтраница.ПутьКДаннымЗаголовка = "Объект.бит_СоставБригады.КоличествоСтрок";
		
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригады", Тип("ТаблицаФормы"), Этаформа.Элементы.бит_СтраницаСоставБригады, Неопределено);
		НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады";
		НовыйЭлемент.АвтоВводНовойСтроки = Ложь;
		НовыйЭлемент.ВысотаВСтрокахТаблицы = 6;
		НовыйЭлемент.Отображение = ОтображениеТаблицы.Список;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Верх;
		НовыйЭлемент.УстановитьДействие("ПриНачалеРедактирования", "бит_СоставБригадыПриНачалеРедактирования");
		
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыСотрудник", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.Сотрудник";
		
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыДолжность", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.Должность";
		НовыйЭлемент.БыстрыйВыбор = Ложь;
		НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "бит_СоставБригадыДолжностьНачалоВыбора");
		
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыРазряд", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.Разряд";
		НовыйЭлемент.БыстрыйВыбор = Ложь;
		НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "бит_СоставБригадыРазрядНачалоВыбора");
		
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыНачисление", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.Начисление";
		НовыйЭлемент.БыстрыйВыбор = Ложь;
		НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		НовыйЭлемент.УстановитьДействие("НачалоВыбора", "бит_СоставБригадыНачислениеНачалоВыбора");
		
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыНачислениеКод", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Код начисления";
		НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.Начисление.Код";
		
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыВремяФакт", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.ВремяФакт";
		НовыйЭлемент.Доступность = Ложь;
		
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыЕдиницаИзмерения", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.ЕдиницаИзмерения";
		
		НовыйЭлемент = Этаформа.Элементы.Вставить("бит_СоставБригадыКомментарий", Тип("ПолеФормы"), ЭтаФорма.Элементы.бит_СоставБригады, Неопределено);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.бит_СоставБригады.Комментарий";
		НовыйЭлемент.Доступность = Истина;
		НовыйЭлемент.ТолькоПросмотр = Истина;
		
		//Кнопка
		Команда = ЭтаФорма.Команды.Добавить("бит_ЗаполнитьСоставБригады");
		Команда.Действие = "бит_ЗаполнитьСоставБригады";
		Команда.Заголовок = "(бит) Заполнить состав бригады";
		
		//Добавляем новую кнопку
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ЗаполнитьСоставБригады", Тип("КнопкаФормы"), ЭтаФорма.Элементы.бит_СоставБригадыКоманднаяПанель);
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовыйЭлемент.Заголовок = "(бит) Заполнить состав бригады";
		НовыйЭлемент.ИмяКоманды = "бит_ЗаполнитьСоставБригады";
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [6.1.1] [ASHolyavko@1cbit.ru] [09.11.2025] -
	
	
	// {{ПервыйБИТ ЛистТребований [6.1.3] [ASHolyavko@1cbit.ru] [19.11.2025] +        
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_КоличествоХодовОперация", Тип("ПолеФормы"), Элементы.ГруппаОсновноеПраво);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КоличествоХодовОперация";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_КоличествоХодовОперацияПриИзменении");
	
	НоваяГруппа = Этаформа.Элементы.Вставить("бит_ГруппаВРЦ", Тип("ГруппаФормы"), Элементы.ГруппаОсновноеЛево, Элементы.ВариантНаладки);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Заголовок = "";
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
//	НоваяГруппа.АвтоМаксимальнаяШирина = Ложь;
	НоваяГруппа.РастягиватьПоГоризонтали = Ложь;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_КодВРЦ", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Ширина = 8;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;	
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным = "Объект.ВидРабочегоЦентра.бит_КодВРЦ";
	
	Элементы.Переместить(Элементы.ВидРабочегоЦентра, НоваяГруппа, НовыйЭлемент);
	
	Элементы.ВариантНаладки.Видимость = Объект.ВидРабочегоЦентра.ИспользуютсяВариантыНаладки;
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_Сверхурочно", Тип("ПолеФормы"), Элементы.СтраницаОсновное);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Сверхурочно";

	
	// }}ПервыйБИТ ЛистТребований [6.1.3] [ASHolyavko@1cbit.ru] [19.11.2025] -
	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.6] [ASHolyavko@1cbit.ru] [24.12.2025] +        

	МассивНачислений = Новый Массив;
	Начисление_105 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Начисление_105, Неопределено, Истина);
	Начисление_107 = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.Начисление_107, Неопределено, Истина);
	
	МассивНачислений.Добавить(Начисление_105);
	МассивНачислений.Добавить(Начисление_107);
	
	СписокНачислений = Новый СписокЗначений;
	СписокНачислений.ЗагрузитьЗначения(МассивНачислений);
	
	//ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	//ЭлементОформления.Использование = Истина;
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость",  Истина);
	//
	//ЭлементУсловия                = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.бит_СоставБригады.Начисление");
	//ЭлементУсловия.ПравоеЗначение = СписокНачислений; 
	//ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	//ЭлементУсловия.Использование  = Истина;
	//
	//ОформляемоеПоле      = ЭлементОформления.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("бит_СоставБригадыКомментарий"); 
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.бит_СоставБригадыКомментарий.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.бит_СоставБригады.Начисление");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокНачислений;
	ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
	//Элемент.Оформление.УстановитьЗначениеПараметра("АвтоОтметкаНезаполненного", Истина);
	Элемент.Использование = Истина;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.6] [ASHolyavko@1cbit.ru] [24.12.2025] -
	
	
КонецПроцедуры  

&НаКлиенте
Процедура бит_СоставБригадыДолжностьНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", ПолучитьСписокДолжностей(Объект.СменноеЗадание));
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	
	ОткрытьФорму("Справочник.Должности.ФормаВыбора", ПараметрыФормы, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура бит_СоставБригадыРазрядНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", ПолучитьСписокРазрядов(Объект.СменноеЗадание));
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	
	ОткрытьФорму("Справочник.РазрядыКатегорииДолжностей.ФормаВыбора", ПараметрыФормы, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура бит_СоставБригадыНачислениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", ПолучитьСписокНачислений());
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	
	ОткрытьФорму("ПланВидовРасчета.Начисления.ФормаВыбора", ПараметрыФормы, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДолжностей(Смена)                                                          
	Возврат РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.ПолучитьСписокДолжностей(Смена);
КонецФункции

&НаСервере
Функция ПолучитьСписокРазрядов(Смена)
	Возврат РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.ПолучитьСписокРазрядов(Смена);
КонецФункции

&НаСервере
Функция ПолучитьСписокНачислений()
	Возврат РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.ПолучитьСписокНачислений();
КонецФункции

&НаКлиенте
Процедура бит_ЗаполнитьСоставБригады()
	
	бит_ЗаполнитьСоставБригадыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура бит_ЗаполнитьСоставБригадыНаСервере()
	
	Объект.бит_СоставБригады.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственнаяОперация2_2Трудозатраты.ВидРабот КАК ВидРабот,
		|	ПроизводственнаяОперация2_2Трудозатраты.ВидРабот.бит_Должность КАК ВидРаботбит_Должность,
		|	ПроизводственнаяОперация2_2Трудозатраты.ВидРабот.КвалификационныйРазряд КАК ВидРаботКвалификационныйРазряд
		|ПОМЕСТИТЬ вт_Трудозатраты
		|ИЗ
		|	Документ.ПроизводственнаяОперация2_2.Трудозатраты КАК ПроизводственнаяОперация2_2Трудозатраты
		|ГДЕ
		|	ПроизводственнаяОперация2_2Трудозатраты.Ссылка = &ДокументПроизводства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_СоставИсполнителейИВремяВыполнения.Сотрудник КАК Сотрудник,
		|	бит_СоставИсполнителейИВремяВыполнения.Должность КАК Должность,
		|	бит_СоставИсполнителейИВремяВыполнения.ДокументПроизводства КАК ДокументПроизводства,
		|	бит_СоставИсполнителейИВремяВыполнения.Разряд КАК Разряд,
		|	бит_СоставИсполнителейИВремяВыполнения.Начисление КАК Начисление,
		|	бит_СоставИсполнителейИВремяВыполнения.ЧасыНорма КАК ЧасыНорма,
		|	бит_СоставИсполнителейИВремяВыполнения.ЧасыФакт КАК ЧасыФакт,
		|	вт_Трудозатраты.ВидРабот КАК ВидРабот
		|ИЗ
		|	вт_Трудозатраты КАК вт_Трудозатраты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СоставИсполнителейИВремяВыполнения КАК бит_СоставИсполнителейИВремяВыполнения
		|		ПО вт_Трудозатраты.ВидРаботбит_Должность = бит_СоставИсполнителейИВремяВыполнения.Должность
		|			И вт_Трудозатраты.ВидРаботКвалификационныйРазряд = бит_СоставИсполнителейИВремяВыполнения.Разряд
		|ГДЕ
		|	бит_СоставИсполнителейИВремяВыполнения.Смена = &Смена
		|	И бит_СоставИсполнителейИВремяВыполнения.ДокументПроизводства = НЕОПРЕДЕЛЕНО
		|	И ВЫБОР
		|			КОГДА &ЭтоБригада
		|				ТОГДА бит_СоставИсполнителейИВремяВыполнения.Бригада = &Исполнитель
		|						И бит_СоставИсполнителейИВремяВыполнения.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|			ИНАЧЕ бит_СоставИсполнителейИВремяВыполнения.Сотрудник = &Исполнитель
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДокументПроизводства", Объект.Ссылка);
	Запрос.УстановитьПараметр("ЭтоБригада", ТипЗнч(Объект.Исполнитель) = Тип("СправочникСсылка.Бригады"));
	Запрос.УстановитьПараметр("Исполнитель", Объект.Исполнитель);
    Запрос.УстановитьПараметр("Смена", Объект.СменноеЗадание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.бит_СоставБригады.Добавить();
		НоваяСтрока.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		НоваяСтрока.Должность = ВыборкаДетальныеЗаписи.Должность;
		НоваяСтрока.Разряд = ВыборкаДетальныеЗаписи.Разряд;
		НоваяСтрока.Начисление = ВыборкаДетальныеЗаписи.Начисление;
		НоваяСтрока.ВремяФакт = ВыборкаДетальныеЗаписи.ЧасыФакт;
		НоваяСтрока.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Час;	
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_КоличествоХодовОперацияПриИзменении()

	// {{ПервыйБИТ ЛистТребований [ЛТ 6.1.3] [ASHolyavko@1cbit.ru] [09.11.2025] +        

	ПолучитьВидРаботПоКоличествуХодов();	
	
	// }}ПервыйБИТ ЛистТребований [ЛТ 6.1.3] [ASHolyavko@1cbit.ru] [09.11.2025] -
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьВидРаботПоКоличествуХодов()

	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("КодВРЦ", Объект.ВидРабочегоЦентра);
	СтруктураОтбора.Вставить("КодОперации", Объект.Операция.бит_КодОперации);
	СтруктураОтбора.Вставить("Номенклатура", Спецификация.ОсновноеИзделиеНоменклатура);
	СтруктураОтбора.Вставить("РассчитываемоеКоличествоХодов", Объект.бит_КоличествоХодовОперация);
	
	ВидРабот = Документы.ПроизводственнаяОперация2_2.ПолучитьВидРаботПоОтбор(СтруктураОтбора);
	
	Если ЗначениеЗаполнено(ВидРабот) Тогда
		Объект.ВремяВыполнения = ВидРабот.бит_ВремяВыполнения;
		Объект.бит_ВремяВыполненияНорма = ВидРабот.бит_ВремяВыполнения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ПроцентВыполненияВремениПриИзменении()

	// {{ПервыйБИТ ЛистТребований [ЛТ 6.1.1] [ASHolyavko@1cbit.ru] [09.11.2025] +        
		
	//Если Объект.бит_ВремяВыполненияНорма <> 0 
	//	И Окр(100 * Объект.ВремяВыполнения / Объект.бит_ВремяВыполненияНорма, 2) <> Объект.бит_ПроцентВыполненияВремени Тогда
	//	Элементы.бит_ПроцентВыполненияВремени.ЦветТекста = Новый Цвет(255,0,0);
	//	Элементы.бит_ПроцентВыполненияВремени.Шрифт = Новый Шрифт(,,Истина);
	//Иначе
	//	Элементы.бит_ПроцентВыполненияВремени.ЦветТекста = Новый Цвет(0,0,0);
	//	Элементы.бит_ПроцентВыполненияВремени.Шрифт = Новый Шрифт(,,Ложь);
	//КонецЕсли; 
	
	//Если Объект.бит_ВремяВыполненияНорма <> 0 Тогда
	//	Объект.бит_ПроцентВыполненияВремени = Окр(100 * Объект.ВремяВыполнения / Объект.бит_ВремяВыполненияНорма, 2);
	//КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ 6.1.1] [ASHolyavko@1cbit.ru] [09.11.2025] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_АтрибутыТары(Команда)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:05:37] +        
	ИмяТЧ = "ВыходныеИзделия";
	ИмяТЧСерии = "ВыходныеИзделияСерии";
	
	ТД = Элементы[ИмяТЧ].ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ПФ = Неопределено;
		Если ЗначениеЗаполнено(ТД.Серия) Тогда
			ПФ = Новый Структура("Ключ, Документ, Номенклатура, Упаковка, Количество, КоличествоУпаковок, НомерСтроки",
								ТД.Серия,
								Объект.Ссылка, 
								ТД.Номенклатура,
								ТД.Упаковка,
								ТД.Количество, 
								ТД.КоличествоУпаковок,
								ТД.НомерСтроки);	
		Иначе
			СписокСерий = Объект[ИмяТЧСерии].НайтиСтроки(Новый Структура("Номенклатура,Характеристика", ТД.Номенклатура, ТД.Характеристика));
			Если СписокСерий.Количество() = 1 Тогда 
				ПФ = Новый Структура("Ключ, Документ, Номенклатура, Упаковка, Количество, КоличествоУпаковок, НомерСтроки",
								СписокСерий[0].Серия,
								Объект.Ссылка, 
								ТД.Номенклатура,
								ТД.Упаковка,
								ТД.Количество,
								ТД.КоличествоУпаковок,
								ТД.НомерСтроки);
			Иначе
				ОткрытьПодборСерий(ИмяТЧ);
			КонецЕсли;
		КонецЕсли;   
	КонецЕсли;
	Если ПФ <> Неопределено Тогда
		ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.бит_ФормаАтрибутыТары", ПФ, ЭтаФорма, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.37]  [VUVaynula@1cbit.ru] [26.05.2025 2:05:37] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ВремяВыполненияПриИзмененииПосле(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ 6.1.1] [ASHolyavko@1cbit.ru] [09.11.2025] +        	
	
	//Если Объект.бит_ВремяВыполненияНорма <> 0 
	//	И Окр(100 * Объект.ВремяВыполнения / Объект.бит_ВремяВыполненияНорма, 2) <> Объект.бит_ПроцентВыполненияВремени Тогда
	//	Элементы.бит_ПроцентВыполненияВремени.ЦветТекста = Новый Цвет(255,0,0);
	//	Элементы.бит_ПроцентВыполненияВремени.Шрифт = Новый Шрифт(,,Истина);
	//Иначе
	//	Элементы.бит_ПроцентВыполненияВремени.ЦветТекста = Новый Цвет(0,0,0);
	//	Элементы.бит_ПроцентВыполненияВремени.Шрифт = Новый Шрифт(,,Ложь);
	//КонецЕсли; 
	//
	//Если Объект.бит_ВремяВыполненияНорма <> 0 Тогда
	//	Объект.бит_ПроцентВыполненияВремени = Окр(100 * Объект.ВремяВыполнения / Объект.бит_ВремяВыполненияНорма, 2);
	//КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ 6.1.1] [ASHolyavko@1cbit.ru] [09.11.2025] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СоставБригадыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда

        Элемент.ТекущиеДанные.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Час");

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СтатусПриИзмененииПосле(Элемент)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [28.11.2025] +        
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполнена") Тогда
		
		Объект.бит_КоличествоФакт = Объект.ВыходныеИзделия.Итог("КоличествоУпаковок");		
		
		ПересчитатьНормуИФактВремени();
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [28.11.2025] -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ВидРабочегоЦентраПриИзмененииПосле(Элемент)
	
	Элементы.ВариантНаладки.Видимость = ИспользуютсяВариантыНаладки(Объект.ВидРабочегоЦентра);
	
КонецПроцедуры

&НаСервере
Функция ИспользуютсяВариантыНаладки(ВидРабочегоЦентра)
	Возврат ВидРабочегоЦентра.ИспользуютсяВариантыНаладки;
КонецФункции

&НаКлиенте
&После("ВыполнениеИКонтрольВводКоличестваЗавершение")
Процедура бит_ВыполнениеИКонтрольВводКоличестваЗавершение(Результат, ДополнительныеПараметры)
	
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.6] [ASHolyavko@1cbit.ru] [24.12.2025] +        
	
	ПересчитатьНормуИФактВремени(); 
	РасчитатьИтоговоеЗначениеКоличествоФакт();
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.6] [ASHolyavko@1cbit.ru] [24.12.2025] -
	
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьНормуИФактВремени()
	
	ЕдИзмеренияСпецификации = Спецификация.ОсновноеИзделиеУпаковка;	
	НоменклатураВыпуска = Спецификация.ОсновноеИзделиеНоменклатура;
	ЕдИзмеренияИзделия = Спецификация.ОсновноеИзделиеНоменклатура.ЕдиницаИзмерения;
	
	КоэффициентВыпуска = Объект.КоличествоФакт / Объект.Количество;
	
	НормаВремени = 0;
	
	Если ЕдИзмеренияИзделия <> ЕдИзмеренияСпецификации Тогда
	КонецЕсли;	
	
	Для Каждого СтрокаТрудозатрат из Объект.Трудозатраты Цикл
		
		НормаВремениТрудозатрат = СтрокаТрудозатрат.Количество * СтрокаТрудозатрат.ВидРабот.Трудоемкость; 
		НормаВремениТрудозатрат = НормаВремениТрудозатрат * КоэффициентВыпуска;
		
		Если ЕдИзмеренияСпецификации <> СтрокаТрудозатрат.ВидРабот.ЕдиницаИзмерения Тогда
			
			//ДанныеОбУпаковке = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентВесОбъемПрочиеРеквизитыУпаковки(СтрокаТрудозатрат.ВидРабот.ЕдиницаИзмерения, НоменклатураВыпуска, , Ложь);
			//
			//КоэффициентВыпуска = (Объект.КоличествоФакт / ДанныеОбУпаковке.Коэффициент) * ;
			
		КонецЕсли;
		
		НормаВремени = НормаВремени + НормаВремениТрудозатрат;
		
	КонецЦикла;
	
	//Если Объект.ВремяВыполненияЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Минута Тогда
	//	НормаВремени = НормаВремени * 60;
	//КонецЕсли;
	
	Для Каждого СтрокаСоставБригады из Объект.бит_СоставБригады Цикл
		СтрокаСоставБригады.ВремяФакт = НормаВремени;
		СтрокаСоставБригады.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Час;
	КонецЦикла;
	
	Объект.бит_ВремяВыполненияНорма = НормаВремени;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ВыходныеИзделияКоличествоУпаковокПриИзмененииПосле(Элемент)
	РасчитатьИтоговоеЗначениеКоличествоФакт();	
КонецПроцедуры  

&НаСервере
Функция ПолучитьНоменклатуруСпецификации(Спецификация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура
		|ИЗ
		|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
		|ГДЕ
		|	РесурсныеСпецификации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Спецификация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ОсновноеИзделиеНоменклатура;
	КонецЦикла;
	
	Возврат ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	
	
КонецФункции

&НаКлиенте
Процедура бит_ВыходныеИзделияПриИзмененииПосле(Элемент)
	РасчитатьИтоговоеЗначениеКоличествоФакт();
КонецПроцедуры   

&НаКлиенте
Процедура РасчитатьИтоговоеЗначениеКоличествоФакт()
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Номенклатура", ПолучитьНоменклатуруСпецификации(Спецификация));
	
	НайденныеСтроки = Объект.ВыходныеИзделия.НайтиСтроки(ОтборСтрок);
	
	Количество = 0;
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Количество = Количество + НайденнаяСтрока.КоличествоУпаковок;
	КонецЦикла;
	
	Объект.бит_КоличествоФакт = Количество
				
КонецПроцедуры
